{
  "nav.about": "About",
  "nav.about.path": "/about",
  "nav.projects": "Projects",
  "nav.projects.path": "/projects",
  "nav.resume": "Resume",
  "nav.resume.path": "/resume",
  "footer": "Edited and hosted by Thomas Ritaine",
  "home.hi": "Hi there !",
  "home.iam": "I am",
  "home.type.engineer": "Software engineer",
  "home.type.freelance": "Freelance",
  "home.type.devops": "DevOps - Webmaster",
  "home.type.opensource": "Open source contributor",
  "home2.introduce.title": "Let me <b>introduce</b> myself",
  "home2.introduce.body.part1": "I started by developing programs on my calculator, and at the age of 16, I launched my first website.<br />Today, I am ",
  "home2.introduce.body.part2": " years old, and this passion has never left me. In fact, I graduated as a <b>computer science engineer</b> from the ",
  "home2.introduce.body.part3": "I am proficient in web languages such as <b>JavaScript</b> and <b>PHP</b>, and I have specialized in <i>Back-End</i> development using frameworks like <b>NestJS</b> and <b>Symfony</b>. I have contributed to <i>Open Source</i> projects on <b>GitHub</b> and have worked on innovative applications in the corporate environment.",
  "home2.introduce.body.part4": "Furthermore, since \"<i>a good developer is a lazy developer</i>\", I have automated all my web application deployment processes using <b>Docker</b>, <b>GitHub Actions</b>, and <b>Bash</b>.<br />As a result:",
  "home2.introduce.body.ul.1": "A drastic increase in security",
  "home2.introduce.body.ul.2": "Simplification of procedures",
  "home2.introduce.body.ul.3": "Reduction of human error",
  "home2.introduce.body.ul.4": "Financial costs reduction",
  "home2.introduce.body.part5": "Lately, I have been taking a keen interest in <b>Cybersecurity</b>, particularly for my web servers, as well as automating daily tasks using <b>Python</b>.",
  "home2.media.title": "Find me on social networks",
  "home2.media.body": "Feel free to <b>contact</b> me",
  "about.discover.title": "Discover who <b>I am</b>",
  "about.discover.body": "Hi everyone, I am <b>Thomas Ritaine</b>, from <b>Reims, France</b>.<br />I have recently graduated as a computer science engineer specialized in web technologies from the UTT, University of Technology of Troyes.<br />Currently, I am employed at <b>#Prox-i</b>, a digital communication agency in Papeete, Tahiti, as a <b>DevOps</b>.<br /><br />Apart from developing and creating information systems, here are a few activities that inspire me!",
  "about.discover.body.ul.1": "Practicing sports: running, gymnastics, and street workout",
  "about.discover.body.ul.2": "Playing guitar",
  "about.discover.body.ul.3": "Traveling, meeting new people, and discovering new cultures",
  "about.discover.quote": "Every great developer you know got there by solving problems they were unqualified to solve, until they actually did it.",
  "about.skills.title": "Professional <b>skillset</b>",
  "about.tools.title": "<b>Tools</b> I use",
  "about.github.title": "My <b>Open Source</b> contributions",
  "projects.title": "My recent <b>Works</b>",
  "projects.body": "Here are a few projects I've worked on recently.",
  "projects.vps.title": "My personal server",
  "projects.vps.body": "I rent a server and host my personal projects as well as those of my clients. I have configured the server from A to Z, using Grafana as a monitoring tool, phpMyAdmin for database administration, Traefik as a reverse-proxy with IP filtering and HTTP authentication for sensitive pages, an SFTP server, SSH connections with PubKey + 2FA TOTP, a firewall + fail2ban, and automated daily backups, all using Docker.",
  "projects.ci-cd.title": "CI CD pipeline",
  "projects.ci-cd.body": "A CI CD pipeline based on GitHub Actions, Docker, and Bash scripts. It automatically checks the code, updates dependencies, and deploys to a pre-production environment when pushing to the dev branch, and to production when pushing to the main branch, both cases being behind a reverse-proxy. This project is currently in a private repository.",
  "projects.portfolio.title": "My portfolio",
  "projects.portfolio.body": "The portfolio you are currently viewing is made with React, it is responsive, uses animations, loads very quickly thanks to image optimization in WebP format, and is hosted on my personal server.",
  "projects.terminal.title": "Customization of my Bash terminal",
  "projects.terminal.body": "I have used Starship to customize my Bash terminal, and I have created an automated installation script. This interface displays various information such as the username and local or remote machine name, the Docker status of the current directory's app, the languages used, the execution time, the return code of the last command, and more.",
  "projects.etuutt.title": "EtuUTT - API",
  "projects.etuutt.body": "An API that serves as the Back-End for the UTT student website, which is an engineering school. This web application, implemented in Symfony with API Platform, allows users to view the list of students, search and rate courses, compare schedules, and much more. Among other things, I have fully written the README and API documentation.",
  "resume.download": "Download my resume"
}
