{
  "nav.about": "About",
  "nav.about.path": "/about",
  "nav.projects": "Projects",
  "nav.projects.path": "/projects",
  "nav.resume": "Resume",
  "nav.resume.path": "/resume",
  "footer": "Edited and hosted by Thomas Ritaine",
  "home.hi": "Hi there !",
  "home.iam": "I am",
  "home.view_projects": "View My Projects",
  "home.type.engineer": "Software engineer",
  "home.type.devops": "DevOps",
  "home.type.opensource": "Open source contributor",
  "home2.introduce.title": "Let me <b>introduce</b> myself",
  "home2.introduce.body.part1": "I began my tech journey creating simple programs on my calculator, then built and deployed my first website at the age of 16.<br />Today, I am ",
  "home2.introduce.body.part2": " and work as a <b>Software Engineer</b> at the <b>European Commission</b>.",
  "home2.introduce.body.early_programming": "My passion for coding started early. At 16, I created my first website - a client-side encryption tool for text messages that demonstrated various cryptographic algorithms like AES and RSA. You can see this project redeployed here: ",
  "home2.introduce.body.cryptea_link": "Cryptea Encryption Tool",
  "home2.introduce.body.section1.title": "Tech Expertise",
  "home2.introduce.body.section1.body.li1": "Daily user of <b>Node.js</b> with Express.js and TypeScript.",
  "home2.introduce.body.section1.body.li2": "I utilize <b>GitHub</b> and <b>GitLab</b> to automate everything: my tests, builds, deployments, etc.",
  "home2.introduce.body.section1.body.li3": "Expert in <b>Docker</b> and <b>Kubernetes</b> (CKA certified).",
  "home2.introduce.body.section2.title": "AI Integration & Innovation",
  "home2.introduce.body.section2.body": "I am deeply interested in generative AI, particularly in <b>Midjourney</b> and OpenAI's models like <b>GPT-4</b> and <b>Whisper</b>. My projects often incorporate AI to create images and text, enhancing functionality and user experience.",
  "home2.introduce.body.section3.title": "Personal Servers & Infrastructure",
  "home2.introduce.body.section3.body": "I own multiple servers where I deploy various applications, like this portfolio. I also use cloud services and platforms like <b>Supabase</b> to build scalable backends for my mobile apps.<br /><br />By the way, this portfolio is also accessible as a <b>Hidden Service</b> on the <b>Tor</b> network: ",
  "home2.introduce.body.section4.title": "Mobile Development",
  "home2.introduce.body.section4.body": "I also develop mobile apps using <b>React Native</b> and <b>Expo</b>, bringing ease of development and cross-platform compatibility to my projects.",
  "home2.introduce.body.section5.title": "Continuous Learning & Open Source",
  "home2.introduce.body.section5.body": "Driven by a relentless curiosity, I constantly explore the latest in web technologies, cloud's new features, and trending GitHub repos. All my projects are open source, and everything is available on my <b>GitHub</b> profile.",
  "home2.introduce.body.footer": "Feel free to explore my projects and reach out for potential collaborations!",
  "home2.media.title": "Find me on social networks",
  "home2.media.body": "Feel free to <b>contact</b> me",
  "about.discover.title": "Discover who <b>I am</b>",
  "about.discover.body": "Hi everyone, I am <b>Thomas Ritaine</b>, from <b>Reims, France</b>.<br />I have graduated as a computer science engineer specialized in web technologies from the UTT, University of Technology of Troyes.<br />Currently, I am employed at the <b>European Commission</b> in Brussels, as a <b>Software Engineer</b>.<br /><br />Apart from developing and deploying web applications, here are a few activities that inspire me!",
  "about.discover.body.ul.1": "Practicing sports: running, gymnastics, and street workout",
  "about.discover.body.ul.2": "Playing guitar",
  "about.discover.body.ul.3": "Traveling, meeting new people, and discovering new cultures",
  "about.discover.quote": "Every great developer you know got there by solving problems they were unqualified to solve, until they actually did it.",
  "about.skills.title": "Professional <b>skillset</b>",
  "about.tools.title": "<b>Tools</b> I use",
  "about.github.title": "My <b>Open Source</b> contributions",
  "projects.title": "My recent <b>Works</b>",
  "projects.body": "Here are a few projects I've worked on recently.",
  "projects.nixos.title": "Nix and NixOS Config",
  "projects.nixos.body": "I developed a comprehensive open-source Nix configuration featuring modular flakes with complete documentation on GitHub. This system powers three production NixOS servers with essential administration tools, while also providing my daily development environment on Ubuntu with declarative configurations for Neovim, kubectl, Zsh, and more. I've also repurposed an old laptop into a homelab server that routes traffic securely via Cloudflare Tunnel.",
  "projects.vps.title": "My personal server",
  "projects.vps.body": "I manage a robust personal server hosting client and personal projects, fully configured using Docker. Features include Grafana for real-time monitoring, DBeaver for database management, and Traefik for secure reverse-proxy services. Security is reinforced through IP filtering, SSO with Authentik, SSH with PublicKey and 2FA TOTP, plus a robust firewall and fail2ban setup. Application's data are backed up daily to an encrypted S3 bubket.",
  "projects.ci-cd.title": "CI CD pipeline",
  "projects.ci-cd.body": "Designed and implemented a CI/CD pipeline utilizing GitHub Actions, Docker, and Bash scripting. This automated system performs code checks, dependency updates, and deploys applications to staging and production environments using advanced reverse-proxy configurations. The setup enhances code quality and accelerates the development cycle, housed in a private repository.",
  "projects.portfolio.title": "My portfolio",
  "projects.portfolio.body": "Developed with React, this responsive and fast-loading portfolio is optimized with WebP images and hosted on my personal server. It's also deployed as a hidden service on the dark web to enhance understanding of secure, anonymous web environments. This dual deployment showcases my capability to manage diverse web technologies while prioritizing performance and security.",
  "projects.terminal.title": "My Personal Terminal",
  "projects.terminal.body": "My custom terminal, utilizing Zsh and Starship, enhances the command-line interface through Oh My Zsh for configuration management, zsh-autosuggestions for command completion, and syntax highlighting for clarity. Tailored scripts and settings in this setup maximize efficiency, with a comprehensive README.md for an installation simpler than ever.",
  "projects.etuutt.title": "EtuUTT - API",
  "projects.etuutt.body": "Developed a comprehensive Backend API for the UTT student portal using Symfony and API Platform. This application supports student engagement by facilitating course reviews, schedule comparisons, and detailed searches. I was responsible for crafting the full API and its documentation, and ensuring API reliability and documentation clarity, enhancing user interaction and backend functionality.",
  "projects.cdn.title": "CDN of S3 files for free",
  "projects.cdn.body": "I implemented a CDN solution using Backblaze B2 and Gcore, optimizing the global delivery of my public digital assets such as CVs and logos. The setup included configuring an S3-compatible bucket with user-specific access and integrating it with Gcore's CDN via a dedicated subdomain. This ensures rapid content delivery worldwide at minimal cost.",
  "projects.chatdoc.title": "Chatdoc: a private RAG Chatbot",
  "projects.chatdoc.body": "I contributed to and deployed Chatdoc, an open-source RAG (Retrieval Augmented Generation) chatbot, on various servers using Docker. This chatbot enhances document interactions by retrieving data from multiple sources like SharePoint, Google Drive, and GitLab. It features robust user management and integrates with any LLM, including OpenAI models and local Mixtral instances on Ollama for maximum privacy.",
  "projects.labs-ai-art-tv.title": "Labs AI Art TV: Automated Image Generation",
  "projects.labs-ai-art-tv.body": "Developed with Node.js, Express.js, and Prisma, Labs AI Art TV is a web application that automates the creation of AI-generated images using Midjourney. It impersonates me on Discord to interact with Midjourney, generating hundreds of images at once with GPT-4 generated prompts. Friends can favorite images, and liked ones automatically become NFTs listed on OpenSea, and published on Instagram and Twitter. Source code is available on my GitHub.",
  "projects.ai-art-tv.title": "AI Art TV: Digital Art Showcase",
  "projects.ai-art-tv.body": "AI Art TV is a professionally designed website I built with WordPress. It showcases my best AI-generated artworks, similar to a professional photographer's portfolio. Developed to promote my AI art and attract customers, the site features a stunning design and a custom logo crafted specifically for the project. Visit ai-art.tv to view my hand-selected pieces and explore the art of AI creativity.",
  "projects.qrcode.title": "AI Art TV: Dynamic AI QR Codes",
  "projects.qrcode.body": "I created visually stunning AI-generated QR codes that maintain readability by phones. These QR codes not only attract human attention with their exceptional design but also provide analytics on scans, including frequency, user, and location details. I control the redirection URLs dynamically, allowing targeted engagements to any Website of my clients.",
  "resume.download": "Download my resume"
}
