{
  "nav.about": "A propos",
  "nav.about.path": "/a-propos",
  "nav.projects": "Projets",
  "nav.projects.path": "/projets",
  "nav.resume": "CV",
  "nav.resume.path": "/cv",
  "footer": "Edité et hébergé par Thomas Ritaine",
  "home.hi": "Bonjour !",
  "home.iam": "Je suis",
  "home.type.engineer": "Ingénieur informatique",
  "home.type.freelance": "Freelance",
  "home.type.devops": "DevOps",
  "home.type.opensource": "Contributeur Open Source",
  "home2.introduce.title": "Laissez-moi <b>me présenter</b>",
  "home2.introduce.body.part1": "J'ai commencé mon parcours dans la tech en créant de petits programmes sur ma calculatrice, puis j'ai développé et déployé mon premier site web à l'âge de 16 ans.<br />Aujourd'hui, j'en ai ",
  "home2.introduce.body.part2": ", et je travaille en tant que <b>Software Enginner</b> à la <b>Commission Européenne</b>.",
  "home2.introduce.body.section1.title": "Expertise Technique",
  "home2.introduce.body.section1.body.li1": "Utilisateur quotidien de <b>Node.js</b> avec Express.js et TypeScript.",
  "home2.introduce.body.section1.body.li2": "J'utilise <b>GitHub</b> et <b>GitLab</b> pour tout automatiser, mes tests, builds, déploiements, etc.",
  "home2.introduce.body.section1.body.li3": "Expert <b>Docker</b> et <b>Kubernetes</b> (certifié CKA).",
  "home2.introduce.body.section2.title": "Intégration d'IA & Innovation",
  "home2.introduce.body.section2.body": "Je suis profondément intéressé par l'IA générative, en particulier par <b>Midjourney</b> et les modèles d'OpenAI comme <b>GPT-4</b> et <b>Whisper</b>. Mes projets intègrent souvent l'IA pour créer des images et du texte, améliorant les fonctionnalités et l'expérience utilisateur.",
  "home2.introduce.body.section3.title": "Serveurs Personnels & Infrastructures",
  "home2.introduce.body.section3.body": "Je possède plusieurs serveurs sur lesquels je déploie diverses applications, comme ce portfolio. J'utilise également des services et des plateformes cloud comme <b>Supabase</b> pour construire des backends scalable pour mes applications mobiles.<br /><br />D'ailleurs, ce portfolio est également accessible en tant que <b>Hidden Service</b> sur le réseau <b>Tor</b> : ",
  "home2.introduce.body.section4.title": "Développement Mobile",
  "home2.introduce.body.section4.body": "Je développe également des applications mobiles avec <b>React Native</b> et <b>Expo</b>, apportant facilité de développement et compatibilité multiplateforme à mes projets.",
  "home2.introduce.body.section5.title": "Apprentissage Continu & Open Source",
  "home2.introduce.body.section5.body": "Animé par une curiosité débordante, j'explore constamment les dernières nouveautés en matière de technologies web, les nouvelles fonctionnalités du cloud et les repos GitHub tendance. Tous mes projets sont en open source, et tout est disponible sur mon profil <b>GitHub</b>.",
  "home2.introduce.body.footer": "N'hésitez pas à explorer mes projets et à me contacter pour d'éventuelles collaborations !",
  "home2.media.title": "Trouvez-moi sur les réseaux",
  "home2.media.body": "N'hésitez pas à me <b>contacter</b>",
  "about.discover.title": "Découvrez qui <b>je suis</b>",
  "about.discover.body": "Bonjour tout le monde, je suis <b>Thomas Ritaine</b>, né à <b> Reims, France</b>.<br /> Je suis diplômé ingénieur en Informatique et Systèmes d'Information de l'UTT, Université de Technologie de Troyes.<br />Actuellement, je suis employé à la <b>Commission Européenne</b> à Bruxelles, en tant que <b>Software Engineer</b>.<br /><br />A part développer et déployer des applications web, voici quelques activités qui m'animent !",
  "about.discover.body.ul.1": "Faire du sport : course à pied, gymnastique et <i>street workout</i>",
  "about.discover.body.ul.2": "Jouer de la guitare",
  "about.discover.body.ul.3": "Voyager, rencontrer de nouvelles personnes et découvrir de nouvelles cultures",
  "about.discover.quote": "Tous les bons ingénieurs logiciel que vous connaissez le sont devenus en résolvant des problèmes qu'ils n'étaient pas qualifiés pour résoudre, jusqu'à ce qu'ils le fassent.",
  "about.skills.title": "<b>Compétences</b> professionnelles",
  "about.tools.title": "Les <b>outils</b> que j'utilise",
  "about.github.title": "Mes contributions <b>Open Source</b>",
  "projects.title": "Mes <b>travaux </b> récents",
  "projects.body": "Voici quelques projets sur lesquels j'ai travaillé récemment.",
  "projects.vps.title": "Mon serveur personnel",
  "projects.vps.body": "Je loue un serveur et j'y héberge mes projets personnels et ceux de mes clients. J'ai configuré le serveur de A à Z, avec Grafana comme outil de monitoring, phpMyAdmin en administration des bases de données, Traefik en reverse-proxy, filtrage IP et HTTP auth pour les pages sensibles, un serveur SFTP, des connexions SSH via PubKey + 2FA TOTP, un firewall + fail2ban, et des backup journalières automatisées, le tout avec Docker.",
  "projects.ci-cd.title": "Pipeline CI CD",
  "projects.ci-cd.body": "Une pipeline CI CD basée sur GitHub Actions, Docker et Bash scripts. Elle permet automatiquement de vérifier le code, mettre à jour les dépendances, déployer en pré-prod lors d'un push sur la branche dev, et en prod lors d'un push sur main, dans les deux cas derrière un reverse-proxy. Ce projet est pour l'instant dans un repo privé.",
  "projects.portfolio.title": "Mon portfolio",
  "projects.portfolio.body": "Le portfolio que vous consultez actuellement. Il est réalisé avec React, est responsive, utilise des animations, charge super rapidement grâce à l'optimisation des images en webp, et est hébergé sur mon serveur personnel.",
  "projects.terminal.title": "Customisation de mon terminal Bash",
  "projects.terminal.body": "J'ai utilisé Starship pour customiser mon terminal Bash, et j'ai créé un script d'installation automatique. Cette interface montre diverses informations comme le nom de l'utilisateur et de la machine locale ou distante, le status Docker de l'app du répertoire courant, les languages utilisés, le temps d'exécution et le code de retour de la dernière commande, etc.",
  "projects.etuutt.title": "EtuUTT - API",
  "projects.etuutt.body": "Une API qui sert de Back End au site étudiant de l'UTT, école d'ingénieur. Cette applicaton web implémentée en Symfony avec API Platform permet de voir la liste des étudiants, chercher et noter des cours, comparer des emplois du temps, et bien plus encore. J'ai entre autre rédigé intégralement le README et la documentation de l'API.",
  "resume.download": "Télécharger mon CV"
}
