{
  "nav.about": "À propos de moi",
  "nav.about.path": "/a-propos-de-moi",
  "nav.projects": "Projets",
  "nav.projects.path": "/projets",
  "nav.resume": "CV",
  "nav.resume.path": "/cv",
  "footer": "Edité et hébergé par Thomas Ritaine",
  "home.hi": "Bonjour !",
  "home.iam": "Je suis",
  "home.view_projects": "Voir mes projets",
  "home.type.engineer": "Ingénieur informatique",
  "home.type.devops": "DevOps",
  "home.type.opensource": "Contributeur Open Source",
  "home2.introduce.title": "Laissez-moi <b>me présenter</b>",
  "home2.introduce.body.part1": "J'ai commencé mon parcours dans la tech en créant de petits programmes sur ma calculatrice, puis j'ai développé et déployé mon premier site web à l'âge de 16 ans.<br />Aujourd'hui, j'en ai ",
  "home2.introduce.body.part2": ", et je travaille en tant que <b>Software Enginner</b> à la <b>Commission Européenne</b>.",
  "home2.introduce.body.early_programming": "Ma passion pour le code a commencé tôt. À 16 ans, j'ai créé mon premier site web - un outil de chiffrement côté client pour les messages texte démontrant divers algorithmes cryptographiques comme AES et RSA. Vous pouvez voir ce projet redéployé ici : ",
  "home2.introduce.body.cryptea_link": "Outil de chiffrement Cryptea",
  "home2.introduce.body.section1.title": "Expertise Technique",
  "home2.introduce.body.section1.body.li1": "Utilisateur quotidien de <b>Node.js</b> avec Express.js et TypeScript.",
  "home2.introduce.body.section1.body.li2": "J'utilise <b>GitHub</b> et <b>GitLab</b> pour tout automatiser, mes tests, builds, déploiements, etc.",
  "home2.introduce.body.section1.body.li3": "Expert <b>Docker</b> et <b>Kubernetes</b> (certifié CKA).",
  "home2.introduce.body.section2.title": "Intégration d'IA & Innovation",
  "home2.introduce.body.section2.body": "Je suis profondément intéressé par l'IA générative, en particulier par <b>Midjourney</b> et les modèles d'OpenAI comme <b>GPT-4</b> et <b>Whisper</b>. Mes projets intègrent souvent l'IA pour créer des images et du texte, améliorant les fonctionnalités et l'expérience utilisateur.",
  "home2.introduce.body.section3.title": "Serveurs Personnels & Infrastructures",
  "home2.introduce.body.section3.body": "Je possède plusieurs serveurs sur lesquels je déploie diverses applications, comme ce portfolio. J'utilise également des services et des plateformes cloud comme <b>Supabase</b> pour construire des backends scalable pour mes applications mobiles.<br /><br />D'ailleurs, ce portfolio est également accessible en tant que <b>Hidden Service</b> sur le réseau <b>Tor</b> : ",
  "home2.introduce.body.section4.title": "Développement Mobile",
  "home2.introduce.body.section4.body": "Je développe également des applications mobiles avec <b>React Native</b> et <b>Expo</b>, apportant facilité de développement et compatibilité multiplateforme à mes projets.",
  "home2.introduce.body.section5.title": "Apprentissage Continu & Open Source",
  "home2.introduce.body.section5.body": "Animé par une curiosité débordante, j'explore constamment les dernières nouveautés en matière de technologies web, les nouvelles fonctionnalités du cloud et les repos GitHub tendance. Tous mes projets sont en open source, et tout est disponible sur mon profil <b>GitHub</b>.",
  "home2.introduce.body.footer": "N'hésitez pas à explorer mes projets et à me contacter pour d'éventuelles collaborations !",
  "home2.media.title": "Trouvez-moi sur les réseaux",
  "home2.media.body": "N'hésitez pas à me <b>contacter</b>",
  "about.discover.title": "Découvrez qui <b>je suis</b>",
  "about.discover.body": "Bonjour tout le monde, je suis <b>Thomas Ritaine</b>, né à <b> Reims, France</b>.<br /> Je suis diplômé ingénieur en Informatique et Systèmes d'Information de l'UTT, Université de Technologie de Troyes.<br />Actuellement, je suis employé à la <b>Commission Européenne</b> à Bruxelles, en tant que <b>Software Engineer</b>.<br /><br />A part développer et déployer des applications web, voici quelques activités qui m'animent !",
  "about.discover.body.ul.1": "Faire du sport : course à pied, gymnastique et <i>street workout</i>",
  "about.discover.body.ul.2": "Jouer de la guitare",
  "about.discover.body.ul.3": "Voyager, rencontrer de nouvelles personnes et découvrir de nouvelles cultures",
  "about.discover.quote": "Tous les bons ingénieurs logiciel que vous connaissez le sont devenus en résolvant des problèmes qu'ils n'étaient pas qualifiés pour résoudre, jusqu'à ce qu'ils le fassent.",
  "about.skills.title": "<b>Compétences</b> professionnelles",
  "about.tools.title": "Les <b>outils</b> que j'utilise",
  "about.tech.git.title": "Git",
  "about.tech.git.description": "Je l'utilise pour versionner tous mes projets",
  "about.tech.typescript.title": "TypeScript",
  "about.tech.typescript.description": "J'utilise pour la plupart de mes projets backend",
  "about.tech.node.title": "Node.js",
  "about.tech.node.description": "Alimente la plupart de mes APIs et serveurs web",
  "about.tech.python.title": "Python",
  "about.tech.python.description": "Mon choix pour les scripts et automations",
  "about.tech.docker.title": "Docker",
  "about.tech.docker.description": "J'empaque tous mes projets pour dev et prod",
  "about.tech.kubernetes.title": "Kubernetes",
  "about.tech.kubernetes.description": "Pour déployer mes projets prod professionnellement et personnellement",
  "about.tech.helm.title": "Helm",
  "about.tech.helm.description": "J'utilise pour déployer des apps et installer des outils sur mon homelab",
  "about.tech.jwt.title": "JWT",
  "about.tech.jwt.description": "J'utilise avec OAuth pour l'auth sur mes projets",
  "about.tech.traefik.title": "Traefik Proxy",
  "about.tech.traefik.description": "Le proxy inverse qui sert mes applications web sur mes VPS",
  "about.tech.aws.title": "AWS",
  "about.tech.aws.description": "Où je déploie les backends professionnels que je construis",
  "about.tech.s3.title": "S3",
  "about.tech.s3.description": "Où je stocke les sauvegardes et fichiers statiques de mes projets",
  "about.tech.github_actions.title": "GitHub Actions",
  "about.tech.github_actions.description": "Pour tester, construire et déployer tous mes projets open source",
  "about.tech.supabase.title": "Supabase",
  "about.tech.supabase.description": "Pour le développement rapide et backends non complexes",
  "about.tech.sql.title": "SQL",
  "about.tech.sql.description": "Ma façon préférée de gérer les données en base",
  "about.tech.postgresql.title": "PostgreSQL",
  "about.tech.postgresql.description": "Ma base de données préférée, open source et large communauté",
  "about.tools.linux.title": "Linux",
  "about.tools.linux.description": "Mon OS quotidien pour le développement, j'utilise Ubuntu",
  "about.tools.nixos.title": "NixOS",
  "about.tools.nixos.description": "Configuration reproductible pour mes serveurs",
  "about.tools.neovim.title": "Neovim",
  "about.tools.neovim.description": "Mon éditeur de texte quotidien, efficace et extensible",
  "about.tools.github.title": "GitHub",
  "about.tools.github.description": "Où j'héberge tous mes projets, toujours en open source",
  "about.tools.bitwarden.title": "Bitwarden",
  "about.tools.bitwarden.description": "Mon gestionnaire de mots de passe",
  "about.tools.tor.title": "Tor",
  "about.tools.tor.description": "J'explore les technologies de confidentialité, ce portfolio fonctionne en hidden service",
  "projects.title": "Mes <b>travaux</b> récents",
  "projects.body": "Voici quelques projets sur lesquels j'ai travaillé récemment.",
  "projects.nixos.title": "Configuration Nix et NixOS",
  "projects.nixos.body": "J'ai développé une configuration Nix open-source complète avec des flakes modulaires et une documentation exhaustive sur GitHub. Ce système alimente trois serveurs NixOS en production avec des outils d'administration essentiels, tout en fournissant mon environnement de développement quotidien sur Ubuntu avec des configurations déclaratives pour Neovim, kubectl, Zsh et plus encore. J'ai également reconverti un ancien ordinateur portable en serveur homelab qui achemine le trafic en toute sécurité via Cloudflare Tunnel.",
  "about.github.title": "Mes contributions <b>Open Source</b>",
  "projects.vps.title": "Mon serveur personnel",
  "projects.vps.body": "Je gère un serveur personnel robuste hébergeant des projets clients et personnels, entièrement configuré avec Docker. Les fonctionnalités incluent Grafana pour la surveillance en temps réel, DBeaver pour la gestion des bases de données, et Traefik pour des services de reverse-proxy sécurisés. La sécurité est renforcée par un filtrage IP, SSO avec Authentik, SSH avec clé publique et TOTP à 2 facteurs, ainsi qu'un pare-feu robuste et une configuration fail2ban. Les données des applications sont sauvegardées quotidiennement vers un bucket S3 chiffré.",
  "projects.ci-cd.title": "Pipeline CI/CD",
  "projects.ci-cd.body": "Conception et mise en œuvre d'un pipeline CI/CD utilisant GitHub Actions, Docker et des scripts Bash. Ce système automatisé réalise des vérifications de code, des mises à jour de dépendances, et déploie des applications dans des environnements de pré-production et de production utilisant des configurations de reverse-proxy avancées. Cette configuration améliore la qualité du code et accélère le cycle de développement, hébergée dans un repo privé.",
  "projects.mailserver.title": "Serveur Mail Personnel",
  "projects.mailserver.body": "J'ai déployé et gère mon propre serveur mail utilisant Mail-in-a-Box sur un serveur Ubuntu à 5$/mois avec 400Go de stockage. La configuration inclut une sécurité de niveau entreprise avec DNSSEC, MTA-STS, DMARC, DKIM, et SPF, garantissant une délivrabilité maximale. Ce serveur gère tous mes emails professionnels sur thomas@ritaine.com et héberge des services email pour divers projets personnels et clients, avec des sauvegardes chiffrées automatiques vers S3.",
  "projects.portfolio.title": "Mon portfolio",
  "projects.portfolio.body": "Développé avec React, ce portfolio réactif et rapide est optimisé avec des images WebP et hébergé sur mon serveur personnel. Il est également déployé en tant que Hidden Service sur le dark web pour mieux comprendre les environnements web sécurisés et anonymes. Ce double déploiement met en valeur ma capacité à gérer diverses technologies web tout en priorisant la performance et la sécurité.",
  "projects.terminal.title": "Mon terminal personnel",
  "projects.terminal.body": "Mon terminal personnalisé, utilisant Zsh et Starship, améliore l'interface de ligne de commande grâce à Oh My Zsh pour la gestion des configurations, zsh-autosuggestions pour la complétion des commandes, et la mise en évidence de la syntaxe pour plus de clarté. Des scripts et des configurations sur mesure dans cette installation maximisent l'efficacité, avec un README.md complet pour une installation plus simple que jamais.",
  "projects.etuutt.title": "EtuUTT - API",
  "projects.etuutt.body": "Développement d'une API Backend complète pour le portail étudiant de l'UTT utilisant Symfony et API Platform. Cette application soutient l'engagement des étudiants en facilitant les évaluations de cours, les comparaisons d'horaires, et les recherches détaillées. J'étais responsable de la création complète de l'API et de sa documentation, assurant la fiabilité de l'API et la clarté de la documentation, améliorant l'interaction utilisateur et la fonctionnalité backend.",
  "projects.cdn.title": "CDN de fichiers S3 gratuit",
  "projects.cdn.body": "J'ai mis en œuvre une solution CDN en utilisant Backblaze B2 et Gcore, optimisant la livraison globale de mes fichiers publics tels que mon CV et des logos. La configuration incluait la configuration d'un bucket compatible S3 avec un accès spécifique à l'utilisateur et son intégration avec le CDN de Gcore via un sous-domaine dédié. Cela assure une livraison rapide du contenu partout dans le monde à un coût minimal.",
  "projects.chatdoc.title": "Chatdoc : un chatbot RAG privé",
  "projects.chatdoc.body": "J'ai contribué à et déployé Chatdoc, un chatbot RAG (Retrieval Augmented Generation) open-source, sur divers serveurs en utilisant Docker. Ce chatbot améliore les interactions avec les documents en récupérant des données de plusieurs sources comme SharePoint, Google Drive et GitLab. Il dispose d'une gestion des utilisateurs robuste et s'intègre à tout LLM, y compris les modèles OpenAI et les instances locales Mixtral sur Ollama pour une confidentialité maximale.",
  "projects.phoenix86.title": "Phoenix86 : Laptop vers Serveur Web",
  "projects.phoenix86.body": "J'ai transformé un ancien ordinateur portable en serveur web 24/7 à domicile en utilisant NixOS et Cloudflare Tunnel. Baptisé Phoenix86 (Phoenix pour la renaissance, 86 pour son architecture CPU x86), cette machine reconvertie exécute cloudflared pour se connecter de manière sécurisée à Cloudflare, transférant les requêtes vers les ports locaux sans exposer mon réseau domestique. Le serveur fonctionne en continu à côté de mon routeur WiFi et héberge certains de mes sites web, y compris la démo.",
  "projects.sso.title": "SSO Personnel",
  "projects.sso.body": "J'ai déployé Authentik comme solution SSO pour sécuriser et unifier l'authentification à travers mon infrastructure de serveurs. Intégré avec Traefik, il protège les applications d'administration comme le panneau admin QR code. Il supporte la 2FA comme l'authentification matérielle YubiKey. Au-delà des portes de sécurité, il fournit l'authentification OAuth2 et JWT pour les services compatibles comme Nextcloud. Ce système de connexion unique centralise la gestion des utilisateurs et offre des fonctionnalités de sécurité de niveau entreprise.",
  "projects.labs-ai-art-tv.title": "Labs AI Art TV: Automated Image Generation",
  "projects.labs-ai-art-tv.body": "Développé avec Node.js, Express.js et Prisma, Labs AI Art TV est une application web qui automatise la création d'images générées par IA via Midjourney. Elle m'impersonate sur Discord pour interagir avec Midjourney, produisant des centaines d'images à la fois avec des prompts générés par GPT-4. Mes amis peuvent marquer de cœur leurs images préférées, et celles aimées deviennent automatiquement des NFTs listés sur OpenSea, publiés sur Instagram et Twitter. Code source disponible sur mon GitHub.",
  "projects.ai-art-tv.title": "AI Art TV: Digital Art Showcase",
  "projects.ai-art-tv.body": "AI Art TV est un site web professionnel que j'ai developpé en utilisant WordPress. Il présente mes meilleures œuvres d'art générées par IA, à la manière d'un portfolio de photographe professionnel. Développé pour promouvoir mon art IA et attirer des clients, le site arbore un design superbe et un logo personnalisé spécialement créé pour le projet. Visitez ai-art.tv pour voir mes pièces sélectionnées à la main et explorer l'art de la créativité IA.",
  "projects.qrcode.title": "AI Art TV : QR Codes AI Dynamiques",
  "projects.qrcode.body": "J'ai créé des QR codes générés par IA visuellement impressionnants, qui restent lisibles par les téléphones. Ces QR codes captent l'attention des utilisateurs par leur design exceptionnel et enregistrent des données lorsqu'ils sont scannés, y compris le nombre de scans, le user agent et l'emplacement géographique. Je gère dynamiquement les URLs de redirection, permettant des redirections sur n'importe quel site web de mes clients.",
  "resume.download": "Télécharger mon CV"
}
