{
  "nav.about": "A propos",
  "nav.about.path": "/a-propos",
  "nav.projects": "Projets",
  "nav.projects.path": "/projets",
  "nav.resume": "CV",
  "nav.resume.path": "/cv",
  "footer": "Edité et hébergé par Thomas Ritaine",
  "home.hi": "Bonjour !",
  "home.iam": "Je suis",
  "home.fiverr": "Créer 100 images IA haute qualité de vos idées via mon offre Fiverr",
  "home.type.engineer": "Ingénieur Informatique",
  "home.type.freelance": "Freelance - Patenté",
  "home.type.devops": "DevOps - Webmaster",
  "home.type.ai-artist": "Artist IA",
  "home2.introduce.title": "Laissez-moi <b>me présenter</b>",
  "home2.introduce.body.part1": "J'ai commencé en développant des programmes sur ma calculatrice, puis à 16 ans j'ai mis en ligne mon premier site internet.<br />Aujourd'hui j'en ai ",
  "home2.introduce.body.part2": ", et cette passion ne m'a jamais quittée. En effet, je suis <b>diplômé ingénieur informatique</b> de l'",
  "home2.introduce.body.part3": "Je maîtrise les langages du web tels que <b>JavaScript</b> et <b>PHP</b> et me suis spécialisé dans le devéloppement <i>Back End</i> avec des frameworks comme <b>NestJS</b> et <b>Symfony</b> en contribuant à des projets <i>Open Source</i> sur <b>GitHub</b>, ou en entreprise sur des applications innovantes.",
  "home2.introduce.body.part4": "De plus, puisque \"<i>un bon développeur est un développeur fainéant</i>\", j'ai automatisé tous mes processus de déploiement d'applications web grâce à <b>Docker</b>, <b>GitHub Actions</b> et <b>Bash</b>.<br />Il en résulte :",
  "home2.introduce.body.ul.1": "Une augmentation drastique de la sécurité",
  "home2.introduce.body.ul.2": "Une simplification des procédures",
  "home2.introduce.body.ul.3": "Une réduction de l'erreur humaine",
  "home2.introduce.body.ul.4": "Une réduction des coûts",
  "home2.introduce.body.part5": "Dernièrement, je m'intéresse de près à la <b>Cybersécurité</b>, en particulier pour mes serveurs web, et à l'automatisation de tâches quotidienne en <b>Python</b>.",
  "home2.media.title": "Trouvez-moi sur les réseaux",
  "home2.media.body": "N'hésitez pas à me <b>contacter</b>",
  "about.discover.title": "Découvrez qui <b>je suis</b>",
  "about.discover.body": "Bonjour tout le monde, je suis <b>Thomas Ritaine</b>, né à <b> Reims, France</b>.<br /> Je viens d'être diplômé ingénieur en informatique et systèmes d'information de l'UTT, Université de Technologie de Troyes.<br />Actuellement, je suis employé à <b>#Prox-i</b>, agence de communication digitale à Papeete, Tahiti, en tant que <b>DevOps</b>.<br /><br />A part développer et créer des systèmes d'information, voici quelques activités qui m'animent !",
  "about.discover.body.ul.1": "Faire du sport : course à pied, gymnastique et <i>street workout</i>",
  "about.discover.body.ul.2": "Jouer de la guitare",
  "about.discover.body.ul.3": "Voyager, rencontrer de nouvelles personnes et découvrir de nouvelles cultures",
  "about.discover.quote": "Tous les bons ingénieurs logiciel que vous connaissez le sont devenus en résolvant des problèmes qu'ils n'étaient pas qualifiés pour résoudre, jusqu'à ce qu'ils le fassent.",
  "about.skills.title": "<b>Compétences</b> professionnelles",
  "about.tools.title": "Les <b>outils</b> que j'utilise",
  "about.github.title": "Mes contributions <b>Open Source</b>",
  "projects.title": "Mes <b>travaux </b> récents",
  "projects.body": "Voici quelques projets sur lesquels j'ai travaillé récemment.",
  "projects.vps.title": "Mon serveur personnel",
  "projects.vps.body": "Je loue un serveur et j'y héberge mes projets personnels et ceux de mes clients. J'ai configuré le serveur de A à Z, avec Grafana comme outil de monitoring, phpMyAdmin en administration des bases de données, Traefik en reverse-proxy, filtrage IP et HTTP auth pour les pages sensibles, un serveur SFTP, des connexions SSH via PubKey + 2FA TOTP, un firewall + fail2ban, et des backup journalières automatisées, le tout avec Docker.",
  "projects.ci-cd.title": "Pipeline CI CD",
  "projects.ci-cd.body": "Une pipeline CI CD basée sur GitHub Actions, Docker et Bash scripts. Elle permet automatiquement de vérifier le code, mettre à jour les dépendances, déployer en pré-prod lors d'un push sur la branche dev, et en prod lors d'un push sur main, dans les deux cas derrière un reverse-proxy. Ce projet est pour l'instant dans un repo privé.",
  "projects.portfolio.title": "Mon portfolio",
  "projects.portfolio.body": "Le portfolio que vous consultez actuellement. Il est réalisé avec React, est responsive, utilise des animations, charge super rapidement grâce à l'optimisation des images en webp, et est hébergé sur mon serveur personnel.",
  "projects.terminal.title": "Customisation de mon terminal Bash",
  "projects.terminal.body": "J'ai utilisé Starship pour customiser mon terminal Bash, et j'ai créé un script d'installation automatique. Cette interface montre diverses informations comme le nom de l'utilisateur et de la machine locale ou distante, le status Docker de l'app du répertoire courant, les languages utilisés, le temps d'exécution et le code de retour de la dernière commande, etc.",
  "projects.etuutt.title": "EtuUTT - API",
  "projects.etuutt.body": "Une API qui sert de Back End au site étudiant de l'UTT, école d'ingénieur. Cette applicaton web implémentée en Symfony avec API Platform permet de voir la liste des étudiants, chercher et noter des cours, comparer des emplois du temps, et bien plus encore. J'ai entre autre rédigé intégralement le README et la documentation de l'API.",
  "resume.download": "Télécharger mon CV"
}
